# 筆記2
# input():讓使用者輸入資料
name = input("輸入你的名字:")
age = int(input("輸入你的歲數:"))
print("你好喔，我叫%s，今天我%d歲，請多請教"%(name,age))

# 算術運算子
# + : 兩運算元相加
# - : 兩運算元相減
# * : 兩運算元相乘
# / : 兩運算元相除
# % : 得到餘數
# // : 取得整除的整數
# ** : (運算元 1)的 (運算元 2)次方

# 比較運算子
# == : 運算式 1 是否等於運算式 2
# != : 運算式 1 是否不等於運算式 2
# > : 運算式 1 是否大於運算式 2
# < : 運算式 1 是否小於運算式 2
# >= : 運算式 1 是否大於或等於運算式 2
# <= : 運算式 1 是否小於或等於運算式 2

#邏輯運算子
# not : 傳回與原來比較結果是相反的值。
# and : 只有一個運算元的結果都是 true。
# or : 只有一個運算元的結果都是 flase。

#複合指定運算子
# += : 相加後再指定給原變數
# -= : 相減後再指定給原變數
# *= : 相乘後再指定給原變數
# /= : 相除後再指定給原變數
# %= : 相除得到整數餘數後再指定給原變數
# //= : 相除得到整數商數後再指定給原變數
# ** = :做指定運算後再指定給原變數



